app/controllers/leads_controller.rb

  def create
    @lead = Lead.new(lead_params)
    #@lead.attached_file = lead_params['attached_file'].read
    #render json: @lead #test when submit button form
    if @lead.save
---
INSERT INTO `leads` (`full_name`, `company_name`, `email`, `phone`, `project_name`, `project_desc`, `department`, `message`, `attached_file`, `created_at`, `updated_at`) VALUES ('Jorge Chavarriaga', 'ChavaZystem', 'jorge.chavarriaga@gmail.com', '4384077941', 'Urbanova', 'TEST', 'Residential', 'This is a test', x'35323230333333362e6a7067', '2020-03-23 19:50:11', '2020-03-23 19:50:11')