app/controllers/quote_controller.rb

INSERT INTO `quotes` (`Full_Name`, `Phone_Number`, `Company_Name`, `Email`, `Building_Type`, `Product_Grade`, `Nb_Company`, `Nb_Floor`, `Nb_Basement`, `Nb_Parking`, `Nb_OccupantPerFloor`, `Nb_Ele_Suggested`, `Price_Per_Ele`, `Subtotal`, `Install_Fee`, `Final_Price`, `created_at`, `updated_at`) VALUES ('Jorge Chavarriaga', 12345678, 'ChavaZystem', 'jorge.chavarriaga@gmail.com', 'Corporate', 'prem', 200, 10, 5, 10, 750, '12', '$12,345', '$ 148140.00', '$ 19258.20', '$ 167398.20', '2020-03-24 16:15:14', '2020-03-24 16:15:14')
---
  def create
    @quote = Quote.new(quote_params)
    #render json: @quote #test when submit button form
    if @quote.save